In [134]:
import pandas as pd

In [135]:
import numpy as np

In [136]:
authors = pd.DataFrame({'author_id':[1, 2, 3], 'author_name':['Тургенев', 'Чехов', 'Островский']}, 
                       columns=['author_id', 'author_name'])

In [137]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [138]:
books = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3], 'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 
                                                                       'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 
                                                                       'Таланты и поклонники'], 
                     'price':[450, 300, 350, 500, 450, 370, 290]})

In [139]:
books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [140]:
authors_price = pd.merge(authors, books, on = 'author_id', how = 'outer')

In [141]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [142]:
top5 = authors_price.nlargest(5, 'price')

In [143]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

In [144]:
df_max = authors_price.groupby('author_name').agg({'price':'max'})

In [145]:
df_max

             price
author_name
Островский     370
Тургенев       450
Чехов          500

In [146]:
df_max = df_max.rename(columns={'price':'max_price'})

In [147]:
df_max

             max_price
author_name
Островский         370
Тургенев           450
Чехов              500

In [148]:
df_min = authors_price.groupby('author_name').agg({'price':'min'})

In [149]:
df_min

             price
author_name
Островский     290
Тургенев       300
Чехов          450

In [150]:
df_min = df_min.rename(columns={'price':'min_price'})

In [151]:
df_min

             min_price
author_name
Островский         290
Тургенев           300
Чехов              450

In [152]:
df_mean = authors_price.groupby('author_name').agg({'price':'mean'})

In [153]:
df_mean

                  price
author_name
Островский   330.000000
Тургенев     366.666667
Чехов        475.000000

In [154]:
df_mean = df_mean.rename(columns={'price':'mean_price'})

In [155]:
df_mean

             mean_price
author_name
Островский   330.000000
Тургенев     366.666667
Чехов        475.000000

In [156]:
authors_stat = pd.concat([df_max, df_min], axis=1)

In [157]:
authors_stat

             max_price  min_price
author_name
Островский         370        290
Тургенев           450        300
Чехов              500        450

In [158]:
authors_stat = pd.concat([authors_stat, df_mean], axis=1)

In [159]:
authors_stat

             max_price  min_price  mean_price
author_name
Островский         370        290  330.000000
Тургенев           450        300  366.666667
Чехов              500        450  475.000000

In [160]:
cover = pd.DataFrame({'cover':['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']})

In [161]:
cover

     cover
0  твердая
1   мягкая
2   мягкая
3  твердая
4  твердая
5   мягкая
6   мягкая

In [162]:
authors_price = pd.concat([authors_price, cover], axis=1)

In [163]:
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [164]:
pd.pivot_table?

In [165]:
book_info = pd.pivot_table(authors_price, values='price', index=['author_name','book_title'],
                        columns=['cover'], aggfunc=np.sum)

In [166]:
book_info

cover                             мягкая  твердая
author_name book_title
Островский  Гроза                  370.0      NaN
            Таланты и поклонники   290.0      NaN
Тургенев    Дворянское гнездо      350.0      NaN
            Отцы и дети              NaN    450.0
            Рудин                  300.0      NaN
Чехов       Дама с собачкой          NaN    450.0
            Толстый и тонкий         NaN    500.0

In [167]:
book_info['твердая'].fillna(0, inplace = True)

In [168]:
book_info['мягкая'].fillna(0, inplace = True)

In [169]:
book_info

cover                             мягкая  твердая
author_name book_title
Островский  Гроза                  370.0      0.0
            Таланты и поклонники   290.0      0.0
Тургенев    Дворянское гнездо      350.0      0.0
            Отцы и дети              0.0    450.0
            Рудин                  300.0      0.0
Чехов       Дама с собачкой          0.0    450.0
            Толстый и тонкий         0.0    500.0

In [170]:
book_info.to_pickle('book.info.pkl')

In [171]:
book_info2 = pd.read_pickle('book.info.pkl')

In [172]:
book_info2

cover                             мягкая  твердая
author_name book_title
Островский  Гроза                  370.0      0.0
            Таланты и поклонники   290.0      0.0
Тургенев    Дворянское гнездо      350.0      0.0
            Отцы и дети              0.0    450.0
            Рудин                  300.0      0.0
Чехов       Дама с собачкой          0.0    450.0
            Толстый и тонкий         0.0    500.0

In [173]:
book_info

cover                             мягкая  твердая
author_name book_title
Островский  Гроза                  370.0      0.0
            Таланты и поклонники   290.0      0.0
Тургенев    Дворянское гнездо      350.0      0.0
            Отцы и дети              0.0    450.0
            Рудин                  300.0      0.0
Чехов       Дама с собачкой          0.0    450.0
            Толстый и тонкий         0.0    500.0